//ES6のコードをBabelでトランスパイルししてES5にして動かす
//ES5~ 一年ごとにverアップされていく
//map,reduce,などの便利メソッドを知る
//データのコレクションを綺麗に使えるかどうかで質が問われる
//forループの脱却
//なぜ？ → 1.記述量が多く、タイポミスを招く 2.構文がわかりにくい（可読性が悪い）

//map関数
//元のデータを変化させないことをミューテートという
//元のデータを加工したいときは別のデータを定義してあげる
//配列からコールバック関数に値を渡し、結果の配列に戻り値として返す
//mapは新しい配列を生成し、値を渡してくれる
//map関数は頻出する関数で一覧表示や一覧選択などで利用される

//pluck関数(pluckは通称の名前)以下の条件で使われる関数のことを言う
//pluck関数とは「オブジェクトの配列」と「プロパティ名を表す文字列」を受付けて、渡したプロパティの値だけを含んだ配列を返します。

//filter関数
//配列からコールバック関数値を渡す、この時のデータはbooleanで渡される(true or false)

//find関数
//filter同様戻り値にbooleanを採用

//findWhereメソッド
//
//
//
//
//
//
//
//
//
